import os

current_dir = os.path.dirname(os.path.abspath(__file__))
weights_path = os.path.join(current_dir, "../models/weights.pkl")
accuracy_path = os.path.join(current_dir, "../.metas/accuracy.png")

"""
出现超过或等于10次的疑问词分类
"""
word_category = {
    # "哪些": 0, "有何": 0, "多长": 0, "什么": 0,  # 不定
    "哪里": 1, "地方": 1, "地区": 1, "哪儿": 1, "何地": 1, "哪些地方": 1, "何处": 1,  # 地点
    "时候": 2, "哪一年": 2, "时间": 2, "时期": 2, "哪年": 2, "何年": 2, "多久": 2, "多长时间": 2, "几年": 2, "多少岁": 2, "何时": 2, "多少年": 2,  # 时间
    "谁": 3, "名字": 3, "哪位": 3,   # 人物
    "多少": 4, "几个": 4, "几条": 4,  # 数量
    "怎样": 5, "如何": 5, "怎么": 5,  # 方式
    "是否": 6,  # 判断
    "哪个": 7, "哪家": 7, "哪国": 7,  "哪一": 7, "哪部": 7, "哪一部": 7, "何种": 7,  # 选择
    "为什么": 8, "为何": 8, "原因": 8,  # 原因
    "什么样": 9, "怎么样": 9,  # 评价
}
